In [10]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [13]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [16]:
df

          W         X         Y         Z
A -0.397589 -0.331083 -1.864598  0.864382
B -0.005529 -1.530550  0.219232 -0.048382
C  0.268291 -0.249375 -0.559263 -0.689558
D  0.471328 -0.183613 -0.288580 -0.122796
E  0.735732  1.737015  0.522269 -1.125513

In [17]:
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

In [19]:
df['W']

A   -0.397589
B   -0.005529
C    0.268291
D    0.471328
E    0.735732
Name: W, dtype: float64

In [20]:
df[['X','Y']]

          X         Y
A -0.331083 -1.864598
B -1.530550  0.219232
C -0.249375 -0.559263
D -0.183613 -0.288580
E  1.737015  0.522269

In [21]:
df[['W','Z']]

          W         Z
A -0.397589  0.864382
B -0.005529 -0.048382
C  0.268291 -0.689558
D  0.471328 -0.122796
E  0.735732 -1.125513

In [30]:
type(df['W'])

pandas.core.series.Series

In [31]:
df.W

A   -0.397589
B   -0.005529
C    0.268291
D    0.471328
E    0.735732
Name: W, dtype: float64

In [36]:
df.loc[['D']]

          W         X        Y         Z
D  0.471328 -0.183613 -0.28858 -0.122796

In [35]:
df.loc[['B','C']]

          W         X         Y         Z
B -0.005529 -1.530550  0.219232 -0.048382
C  0.268291 -0.249375 -0.559263 -0.689558

In [40]:
df['new']=df['X']+10

In [42]:
df

          W         X         Y         Z        new
A -0.397589 -0.331083 -1.864598  0.864382   9.668917
B -0.005529 -1.530550  0.219232 -0.048382   8.469450
C  0.268291 -0.249375 -0.559263 -0.689558   9.750625
D  0.471328 -0.183613 -0.288580 -0.122796   9.816387
E  0.735732  1.737015  0.522269 -1.125513  11.737015

In [51]:
df.drop('new',axis=1,inplace=True)

In [52]:
df

          W         X         Y         Z
A -0.397589 -0.331083 -1.864598  0.864382
B -0.005529 -1.530550  0.219232 -0.048382
C  0.268291 -0.249375 -0.559263 -0.689558
D  0.471328 -0.183613 -0.288580 -0.122796
E  0.735732  1.737015  0.522269 -1.125513

In [68]:
df.drop('C',axis=0,inplace=True)

In [69]:
df

          W         X         Y         Z
D  0.471328 -0.183613 -0.288580 -0.122796
E  0.735732  1.737015  0.522269 -1.125513

In [70]:
df

          W         X         Y         Z
D  0.471328 -0.183613 -0.288580 -0.122796
E  0.735732  1.737015  0.522269 -1.125513

In [72]:
df>0

      W      X      Y      Z
D  True  False  False  False
E  True   True   True  False

In [73]:
df[df>0]

          W         X         Y   Z
D  0.471328       NaN       NaN NaN
E  0.735732  1.737015  0.522269 NaN

In [94]:
df[df['Y']>0]

          W         X         Y         Z
E  0.735732  1.737015  0.522269 -1.125513

In [75]:
df[df['W']>0]['Z']

D   -0.122796
E   -1.125513
Name: Z, dtype: float64

In [92]:
df[df['Y']>0][['W','X']]

          W         X
E  0.735732  1.737015

In [90]:
df[(df['Z']<0) & (df['Y'] < 0)]

          W         X        Y         Z
D  0.471328 -0.183613 -0.28858 -0.122796

In [88]:
df

          W         X         Y         Z
D  0.471328 -0.183613 -0.288580 -0.122796
E  0.735732  1.737015  0.522269 -1.125513